Restructure: Make repository a standalone backend and remove frontend
